Reports/бит_ЗадолжникиПоДому.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ЗадолжникиПоДому</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗависимыеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗависимыеЛС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчетЗависимый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/бит_ЗадолжникиПоДому/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСверху = 2;
	ТабДок.ПолеСлева = 2;
	ТабДок.ПолеСнизу = 2;
	ТабДок.ПолеСправа = 2;
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("МакетЗадолжникиПоДому");
	
	ОбластьШапкаТипыУслуг = Макет.ПолучитьОбласть("ШапкаТипыУслуг");
	ОбластьШапкаАдресПериод = Макет.ПолучитьОбласть("ШапкаАдресПериод");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаВсего = Макет.ПолучитьОбласть("ВсегоПоДому");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	СтрокаЗаголовок = "";
	
	Если ЗначениеЗаполнено(УслугаГруппаУслуг) Тогда

		
		Для Каждого Услуга ИЗ УслугаГруппаУслуг Цикл
			
			СтрокаЗаголовок = СтрокаЗаголовок + Услуга.Значение + "; ";
			 
		КонецЦикла;
		
		
	Иначе
		
		СтрокаЗаголовок = " все услуги";
		
	КонецЕсли;
	
	ОбластьШапкаТипыУслуг.Параметры.ТипыУслуг =    СтрокаЗаголовок;

	Данные = ПолучитьДанные();

	Подъезд = Неопределено;	
	Здание = Неопределено;
	ПерваяИтерация = Истина;
	
	ПредКвартира = Неопределено;
	
	ПлощадьВсего = 0;
	СальдоНачВсего = 0;
	НачисленоВсего = 0;
	ОплаченоВсего = 0;
	СальдоНаКонецВсего = 0;
	
	Для Каждого СтрокаД Из Данные Цикл
		
		Если ПоПодъездам И НЕ Подъезд = СтрокаД.Подъезд Тогда 
			Если Не ПерваяИтерация Тогда
				
				ОбластьСтрокаВсего.Параметры.ПлощадьВсегоПоДому		= ПлощадьВсего;
				ОбластьСтрокаВсего.Параметры.СальдоНаНачалоВсего	= СальдоНачВсего;		
				ОбластьСтрокаВсего.Параметры.НачисленоЗаМесяцВсего 	= НачисленоВсего;		
				ОбластьСтрокаВсего.Параметры.ОплаченоВсего			= ОплаченоВсего;
				ОбластьСтрокаВсего.Параметры.СальдоНаКонецВсего		= СальдоНаКонецВсего;
				
				ТабДок.Вывести(ОбластьСтрокаВсего);	
				ТабДок.Вывести(ОбластьПодвал);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				
				ПлощадьВсего = 0;
				СальдоНачВсего = 0;
				НачисленоВсего = 0;
				ОплаченоВсего = 0;
				СальдоНаКонецВсего = 0;

			КонецЕсли;
			
			ПерваяИтерация = Ложь;
			
			ОбластьШапкаАдресПериод.Параметры.Период = ПредставлениеМесяца(Месяц(Период.ДатаОкончания)) + " " + Формат(Период.ДатаОкончания, "ДФ=yyyy");
			ОбластьШапкаАдресПериод.Параметры.АдресДома = "" + СтрокаД.Здание + " подъезд " + СтрокаД.Подъезд;
			ТабДок.Вывести(ОбластьШапкаТипыУслуг);
			ТабДок.Вывести(ОбластьШапкаАдресПериод);
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			Подъезд = СтрокаД.Подъезд;
			Здание = СтрокаД.Здание;	

		ИначеЕсли НЕ Здание = СтрокаД.Здание Тогда
			
			Если Не ПерваяИтерация Тогда
				
				ОбластьСтрокаВсего.Параметры.ПлощадьВсегоПоДому		= ПлощадьВсего;
				ОбластьСтрокаВсего.Параметры.СальдоНаНачалоВсего	= СальдоНачВсего;		
				ОбластьСтрокаВсего.Параметры.НачисленоЗаМесяцВсего 	= НачисленоВсего;		
				ОбластьСтрокаВсего.Параметры.ОплаченоВсего			= ОплаченоВсего;
				ОбластьСтрокаВсего.Параметры.СальдоНаКонецВсего		= СальдоНаКонецВсего;
				
				ТабДок.Вывести(ОбластьСтрокаВсего);	
				ТабДок.Вывести(ОбластьПодвал);
				
				ПлощадьВсего = 0;
				СальдоНачВсего = 0;
				НачисленоВсего = 0;
				ОплаченоВсего = 0;
				СальдоНаКонецВсего = 0;

			КонецЕсли;
			
			ПерваяИтерация = Ложь;
			
			ОбластьШапкаАдресПериод.Параметры.Период = ПредставлениеМесяца(Месяц(Период.ДатаОкончания)) + " " + Формат(Период.ДатаОкончания, "ДФ=yyyy");
			ОбластьШапкаАдресПериод.Параметры.АдресДома = СтрокаД.Здание;
			ТабДок.Вывести(ОбластьШапкаТипыУслуг);
			ТабДок.Вывести(ОбластьШапкаАдресПериод);
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			Здание = СтрокаД.Здание;	
						
		КонецЕсли;
			
		ОбластьСтрока.Параметры.Квартира = СтрокаД.Квартира;
		ОбластьСтрока.Параметры.Площадь =   СтрокаД.Площадь;
		ОбластьСтрока.Параметры.СальдоНаНачало = СтрокаД.НачальныйОстаток;
		ОбластьСтрока.Параметры.НачисленоЗаМесяц =  СтрокаД.Начислено; 
		ОбластьСтрока.Параметры.Оплачено =   СтрокаД.Оплачено;
		ОбластьСтрока.Параметры.СальдоНаКонец =   СтрокаД.КонечныйОстаток;
		
		КоличествоМесяцевЗадолженности = 0;
					
		Если СтрокаД.КонечныйОстаток <> 0 И СтрокаД.Начислено <> 0 Тогда
			
			КМЗ = СтрокаД.КонечныйОстаток/СтрокаД.Начислено;
			
			КМЗ = Окр(КМЗ);
			
			КоличествоМесяцевЗадолженности =КМЗ;

		ИначеЕсли СтрокаД.Начислено = 0 ИЛИ НЕ ЗначениеЗаполнено(СтрокаД.Начислено) Тогда
			КоличествоМесяцевЗадолженности = "***";
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоМесяцевЗадолженности = КоличествоМесяцевЗадолженности;
				
		ТабДок.Вывести(ОбластьСтрока);
		
		Если Не ПредКвартира = СтрокаД.Квартира Тогда
		
			ПлощадьВсего 	   = ПлощадьВсего + СтрокаД.Площадь;
		
		КонецЕсли;
		
		СальдоНачВсего     = СальдоНачВсего + СтрокаД.НачальныйОстаток;
		НачисленоВсего 	   = НачисленоВсего +  СтрокаД.Начислено;
		ОплаченоВсего	   = ОплаченоВсего + СтрокаД.Оплачено;
		СальдоНаКонецВсего = СальдоНаКонецВсего + СтрокаД.КонечныйОстаток;
		
		ПредКвартира = СтрокаД.Квартира;	
		
	КонецЦикла;
	
	Если НЕ (ПерваяИтерация) Тогда
		
	    ОбластьСтрокаВсего.Параметры.ПлощадьВсегоПоДому		= ПлощадьВсего;
		ОбластьСтрокаВсего.Параметры.СальдоНаНачалоВсего	= СальдоНачВсего;		
		ОбластьСтрокаВсего.Параметры.НачисленоЗаМесяцВсего 	= НачисленоВсего;		
		ОбластьСтрокаВсего.Параметры.ОплаченоВсего			= ОплаченоВсего;
		ОбластьСтрокаВсего.Параметры.СальдоНаКонецВсего		= СальдоНаКонецВсего;

		ТабДок.Вывести(ОбластьСтрокаВсего);
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЕсли;

	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если (ЗначениеЗаполнено(Адрес) Или (ЗначениеЗаполнено(Участок) И УчастокПодходит(Участок))) 
	И ЗначениеЗаполнено(Период) Тогда
		Результат = СформироватьНаСервере();
	Иначе
	 	Сообщить("Для формирования отчета необходимо установить отбор на период. И либо отбор на адрес, либо на подходящий участок");
	КонецЕсли;

КонецПроцедуры

Функция ЗависимыеЛС(ЛицевыеСчета)
	ЗапросАрхивные = Новый Запрос;
	ЗапросАрхивные.Текст = "ВЫБРАТЬ
	                       |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
	                       |ИЗ
	                       |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                       |ГДЕ
	                       |	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)";
	
	ЗапросАрхивные.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	
	ЛСНА = ЗапросАрхивные.Выполнить().выгрузить();
	ЛСНА = ЛСНА.Скопировать(, "Ссылка");
	
	//ЗапросЗависимыеЛС = Новый Запрос;
	//ЗапросЗависимыеЛС.Текст = "ВЫБРАТЬ
	//                          |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЛицевойСчетЗависимый
	//                          |ИЗ
	//                          |	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	//                          |ГДЕ
	//                          |	бит_ЗависимыеЛС.ЛицевойСчет В(&ЛицевыеСчета)
	//                          |	И НЕ бит_ЗависимыеЛС.ЛицевойСчетЗависимый.Архивный";
	//
	//ЗапросЗависимыеЛС.УстановитьПараметр("ЛицевыеСчета", ЛСНА);
	// 
	//ВыборкаЗависимыеЛС = ЗапросЗависимыеЛС.Выполнить().Выбрать();
	
	ЛСРезультат = Новый Массив;
	
	Для Каждого ЛС Из ЛСНА Цикл
		ЛСРезультат.Добавить(ЛС);	
	КонецЦикла;
	 
	//Пока ВыборкаЗависимыеЛС.Следующий() Цикл
	//	
	//	ЛСРезультат.Добавить(ВыборкаЗависимыеЛС.ЛицевойСчетЗависимый);
	//	
	//КонецЦикла;
	
	Возврат ЛСРезультат; 
	
КонецФункции

Функция ПолучитьДанные()
	
	Адреса = Новый Массив;
	Если ЗначениеЗаполнено(Адрес) Тогда
		
		Адреса.Добавить(Адрес);
	
	КонецЕсли;
	
	Если УчастокПодходит(Участок) Тогда
		ЗапросЗданияПоУчастку = Новый Запрос;
		ЗапросЗданияПоУчастку.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	бит_СписокЗданий.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	                              |ГДЕ
	                              |	бит_СписокЗданий.Участок В(&Участки)";
		ЗапросЗданияПоУчастку.УстановитьПараметр("Участки", Участок);
	
		ВыборкаЗдания = ЗапросЗданияПоУчастку.Выполнить().Выбрать();
	
		Пока ВыборкаЗдания.Следующий() Цикл
		
			Адреса.Добавить(ВыборкаЗдания.Ссылка);
		
		КонецЦикла;
	КонецЕсли;

	УслугиПараметр = Новый Массив;
	
	Для Каждого Услуга ИЗ УслугаГруппаУслуг Цикл
		
		УслугиПараметр.Добавить(Услуга.Значение);
		
	КонецЦикла;
	
	ЗапросУслуги = Новый Запрос;
	ЗапросУслуги.Текст = "ВЫБРАТЬ
	                     |	бит_УслугиЖКХ.Ссылка КАК Ссылка
	                     |ИЗ
	                     |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	                     |ГДЕ
	                     |	(бит_УслугиЖКХ.Ссылка В (&Услуги)
	                     |			ИЛИ бит_УслугиЖКХ.ГруппаУслуги В (&Услуги))";
	
	ЗапросУслуги.УстановитьПараметр("Услуги", УслугиПараметр);
	
	ВыборкаУслуги = ЗапросУслуги.Выполнить().Выбрать();
	
	Услуги = Новый Массив;
	
	Пока ВыборкаУслуги.Следующий() Цикл
		Услуги.Добавить(ВыборкаУслуги.Ссылка);		
	КонецЦикла;
	
	ТипыПомещенийМ = Новый Массив;
	
	Для Каждого Тип Из ТипыПомещений Цикл
		
		ТипыПомещенийМ.Добавить(Тип.Значение);
		
	КонецЦикла;
	
	ЗапросЛицевыеСчета = Новый Запрос;
	ЗапросЛицевыеСчета.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                           |	бит_Квартиры.Ссылка КАК Ссылка
	                           |ПОМЕСТИТЬ ВТ_Квартиры
	                           |ИЗ
	                           |	Справочник.бит_Квартиры КАК бит_Квартиры
	                           |ГДЕ
	                           |	бит_Квартиры.Владелец В(&Адреса)
	                           |;
	                           |
	                           |////////////////////////////////////////////////////////////////////////////////
	                           |ВЫБРАТЬ
	                           |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	                           |ИЗ
	                           |	ВТ_Квартиры КАК ВТ_Квартиры
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                           |		ПО ВТ_Квартиры.Ссылка = бит_ЛицевыеСчета.Квартира";
	ЗАпросЛицевыеСчета.УстановитьПараметр("Адреса", Адреса);
	
	ВыборкаЛицевыеСчета = ЗапросЛицевыеСчета.Выполнить().Выбрать();
	
	ЛС = Новый Массив;
	
	Пока ВыборкаЛицевыеСчета.Следующий() Цикл
		
		ЛС.Добавить(ВыборкаЛицевыеСчета.ЛицевойСчет);
		
	КонецЦикла;
	
	ВсеЛС = ЛС;
	ОсновнойЗапрос = Новый Запрос;
	ОсновнойЗапрос.Текст = "ВЫБРАТЬ
	                       |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	                       |	бит_ЛицевыеСчета.Квартира КАК Квартира,
	                       |	бит_ЛицевыеСчета.Квартира.НомерКвартиры КАК КвартираНомерКвартиры
	                       |ПОМЕСТИТЬ ВТ_Квартиры
	                       |ИЗ
	                       |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                       |ГДЕ
	                       |	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)
	                       |	И бит_ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
						   //shevtsov 27.02.26 Начало
	                       |ВЫБРАТЬ
	                       |	ВТ_Квартиры.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_Квартиры.Квартира КАК Квартира,
	                       |	ВТ_Квартиры.КвартираНомерКвартиры КАК КвартираНомерКвартиры,
	                       |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	                       |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления
	                       |ПОМЕСТИТЬ ВтКвартирыСУслугами
	                       |ИЗ
	                       |	ВТ_Квартиры КАК ВТ_Квартиры
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	                       |				&НачалоПериода,
	                       |				ВЫБОР
	                       |					КОГДА &УслугиЗаполнено > 0
	                       |						ТОГДА Услуга В (&Услуги)
	                       |					ИНАЧЕ ИСТИНА
	                       |				КОНЕЦ) КАК бит_СведенияПоУслугамЛССрезПоследних
	                       |		ПО ВТ_Квартиры.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВтКвартирыСУслугами.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВтКвартирыСУслугами.Квартира КАК Квартира,
	                       |	ВтКвартирыСУслугами.КвартираНомерКвартиры КАК КвартираНомерКвартиры,
	                       |	ВтКвартирыСУслугами.Услуга КАК Услуга
	                       |ПОМЕСТИТЬ втКвартирыСУслугамиСОтбором
	                       |ИЗ
	                       |	ВтКвартирыСУслугами КАК ВтКвартирыСУслугами
	                       |ГДЕ
	                       |	НЕ ВтКвартирыСУслугами.РежимПотребления = ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.НеНачислять)
	                       |;
	                       |
						   //shevtsov 27.02.26 Окончание
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	                       |	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0)) КАК НачальныйОстаток
	                       |ПОМЕСТИТЬ ВТ_ОстаткиНач
	                       |ИЗ
	                       |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	                       |			&НачалоПериода,
	                       |			ЛицевойСчет В (&ЛицевыеСчета)
	                       |				И ВЫБОР
	                       |					КОГДА &УслугиЗаполнено > 0
	                       |						ТОГДА УслугаЖКХ В (&Услуги)
	                       |					ИНАЧЕ ИСТИНА
	                       |				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстатки
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	                       |	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток, 0)) КАК КонечныйОстаток
	                       |ПОМЕСТИТЬ ВТ_ОстаткиКон
	                       |ИЗ
	                       |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	                       |			&ОкончаниеПериодаОст,
	                       |			ЛицевойСчет В (&ЛицевыеСчета)
	                       |				И ВЫБОР
	                       |					КОГДА &УслугиЗаполнено > 0
	                       |						ТОГДА УслугаЖКХ В (&Услуги)
	                       |					ИНАЧЕ ИСТИНА
	                       |				КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстатки
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	МАКСИМУМ(0) КАК НачальныйОстаток,
	                       |	МАКСИМУМ(0) КАК КонечныйОстаток,
	                       |	СУММА(ВЫБОР
	                       |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	                       |				ТОГДА -ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаРасход, 0) + ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход, 0)
	                       |			ИНАЧЕ ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаПриход, 0)
	                       |		КОНЕЦ) КАК Начислено,
	                       |	СУММА(ВЫБОР
	                       |			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	                       |				ТОГДА 0
	                       |			ИНАЧЕ ЕСТЬNULL(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаРасход, 0)
	                       |		КОНЕЦ) КАК Оплачено,
	                       |	ВТ_Квартиры.Квартира КАК Квартира,
	                       |	ВТ_Квартиры.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_Квартиры.ЛицевойСчет.Здание КАК Здание,
	                       |	ВТ_Квартиры.ЛицевойСчет.Здание.Участок КАК Участок,
	                       |	ВТ_Квартиры.Квартира.Подъезд КАК Подъезд,
	                       |	ВТ_Квартиры.КвартираНомерКвартиры КАК НомерКвартиры
	                       |ПОМЕСТИТЬ ВТ_Данные
	                       |ИЗ
						   //shevtsov 27.02.26 Начало
						   //Было:
						   //|	ВТ_Квартиры КАК ВТ_Квартиры
						   //Стало:
	                       |	втКвартирыСУслугамиСОтбором КАК ВТ_Квартиры
						   //shevtsov 27.02.26 Окончание
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	                       |				&НачалоПериода,
	                       |				&ОкончаниеПериода,
	                       |				Регистратор,
	                       |				,
	                       |				ЛицевойСчет В (&ЛицевыеСчета)
	                       |					И ВЫБОР
	                       |						КОГДА &УслугиЗаполнено > 0
	                       |							ТОГДА УслугаЖКХ В (&Услуги)
	                       |						ИНАЧЕ ИСТИНА
	                       |					КОНЕЦ) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	                       |		ПО ВТ_Квартиры.ЛицевойСчет = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	                       |			И ВТ_Квартиры.Квартира = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет.Квартира
						   //shevtsov 27.02.26 Начало
	                       |			И ВТ_Квартиры.Услуга = бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
						   //shevtsov 27.02.26 Окончание
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ_Квартиры.Квартира,
	                       |	ВТ_Квартиры.ЛицевойСчет,
	                       |	ВТ_Квартиры.ЛицевойСчет.Здание,
	                       |	ВТ_Квартиры.ЛицевойСчет.Здание.Участок,
	                       |	ВТ_Квартиры.Квартира.Подъезд,
	                       |	ВТ_Квартиры.КвартираНомерКвартиры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЗависимыйЛицевойСчет,
	                       |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
	                       |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	                       |	ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	                       |	ВТ_Данные.ЛицевойСчет КАК ЛицевойСчет,
	                       |	ВТ_Данные.Здание КАК Здание,
	                       |	ВТ_Данные.Участок КАК Участок,
	                       |	ВТ_Данные.Подъезд КАК Подъезд,
	                       |	ВТ_Данные.НомерКвартиры КАК НомерКвартиры
	                       |ПОМЕСТИТЬ ВТ_ЗависимыеЛС
	                       |ИЗ
	                       |	ВТ_Данные КАК ВТ_Данные
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
	                       |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	                       |			ПО бит_ЗависимыеЛС.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	                       |		ПО ВТ_Данные.ЛицевойСчет = бит_ЗависимыеЛС.ЛицевойСчет
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СУММА(ЕСТЬNULL(ВТ_Данные.Начислено, 0)) КАК Начислено,
	                       |	СУММА(ЕСТЬNULL(ВТ_Данные.Оплачено, 0)) КАК Оплачено,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Здание
	                       |		ИНАЧЕ ВТ_Данные.Здание
	                       |	КОНЕЦ КАК Здание,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.ТипКвартиры
	                       |		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.ТипКвартиры
	                       |	КОНЕЦ КАК ТипКвартиры,
	                       |	ЕСТЬNULL(ВЫБОР
	                       |			КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |				ТОГДА ВТ_ЗависимыеЛС.ОбщаяПлощадь
	                       |			ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
	                       |		КОНЕЦ, 0) КАК Площадь,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Участок
	                       |		ИНАЧЕ ВТ_Данные.Участок
	                       |	КОНЕЦ КАК Участок,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Подъезд
	                       |		ИНАЧЕ ВТ_Данные.Подъезд
	                       |	КОНЕЦ КАК Подъезд,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.лб_ПредставлениеКвартиры
	                       |		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
	                       |	КОНЕЦ КАК Квартира,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.ЛицевойСчет
	                       |		ИНАЧЕ ВТ_Данные.ЛицевойСчет
	                       |	КОНЕЦ КАК ЛицевойСчет,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.НомерКвартиры
	                       |		ИНАЧЕ ВТ_Данные.НомерКвартиры
	                       |	КОНЕЦ КАК НомерКвартиры,
	                       |	0 КАК СтрокаСортировки,
	                       |	МАКСИМУМ(ЕСТЬNULL(ВТ_ОстаткиКон.КонечныйОстаток, 0)) КАК КонечныйОстаток,
	                       |	МАКСИМУМ(ЕСТЬNULL(ВТ_ОстаткиНач.НачальныйОстаток, 0)) КАК НачальныйОстаток
	                       |ИЗ
	                       |	ВТ_Данные КАК ВТ_Данные
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(, ) КАК бит_СведенияОКвартиреСрезПоследних
	                       |		ПО ВТ_Данные.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗависимыеЛС КАК ВТ_ЗависимыеЛС
	                       |		ПО ВТ_Данные.ЛицевойСчет = ВТ_ЗависимыеЛС.ЗависимыйЛицевойСчет
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНач КАК ВТ_ОстаткиНач
	                       |		ПО ВТ_Данные.ЛицевойСчет = ВТ_ОстаткиНач.ЛицевойСчет
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиКон КАК ВТ_ОстаткиКон
	                       |		ПО ВТ_Данные.ЛицевойСчет = ВТ_ОстаткиКон.ЛицевойСчет
	                       |ГДЕ
	                       |	ВЫБОР
	                       |			КОГДА &ТипКвартирыЗаполнено > 0
	                       |				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры В (&ТипКвартиры)
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Здание
	                       |		ИНАЧЕ ВТ_Данные.Здание
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.ТипКвартиры
	                       |		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.ТипКвартиры
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Участок
	                       |		ИНАЧЕ ВТ_Данные.Участок
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.Подъезд
	                       |		ИНАЧЕ ВТ_Данные.Подъезд
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.лб_ПредставлениеКвартиры
	                       |		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
	                       |	КОНЕЦ,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.ЛицевойСчет
	                       |		ИНАЧЕ ВТ_Данные.ЛицевойСчет
	                       |	КОНЕЦ,
	                       |	ЕСТЬNULL(ВЫБОР
	                       |			КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |				ТОГДА ВТ_ЗависимыеЛС.ОбщаяПлощадь
	                       |			ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь
	                       |		КОНЕЦ, 0),
	                       |	ВЫБОР
	                       |		КОГДА ВТ_ЗависимыеЛС.ЛицевойСчет <> НЕОПРЕДЕЛЕНО
	                       |			ТОГДА ВТ_ЗависимыеЛС.НомерКвартиры
	                       |		ИНАЧЕ ВТ_Данные.НомерКвартиры
	                       |	КОНЕЦ
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерКвартиры,
	                       |	Здание,
	                       |	Подъезд";
	
	ОсновнойЗапрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ОсновнойЗапрос.УстановитьПараметр("ОкончаниеПериода", Период.ДатаОкончания);
	ОсновнойЗапрос.УстановитьПараметр("ОкончаниеПериодаОст", Период.ДатаОкончания + 1);
	ОсновнойЗапрос.УстановитьПараметр("УслугиЗаполнено", Услуги.Количество());
	ОсновнойЗапрос.УстановитьПараметр("Услуги", Услуги);
	ОсновнойЗапрос.УстановитьПараметр("ЛицевыеСчета", ВсеЛС);
	ОсновнойЗапрос.УстановитьПараметр("ТипКвартиры", ТипыПомещенийМ);
	ОсновнойЗапрос.УстановитьПараметр("ТипКвартирыЗаполнено", ТипыПомещенийМ.Количество());
	
	РезультатЗапроса = ОсновнойЗапрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРез Из РезультатЗапроса Цикл
	
		ЧастиНомераКвартиры = ОтделениеЧисловойЧастиОтПрочего(СокрЛП(Строка(СтрокаРез.Квартира)));
		СтрокаРез.СтрокаСортировки = ?(ЧастиНомераКвартиры.ЧисловаяЧ="",9999,Число(ЧастиНомераКвартиры.ЧисловаяЧ));
	
	КонецЦикла; 
	
	РезультатЗапроса.Сортировать("СтрокаСортировки, Здание, Подъезд");
	
	Возврат РезультатЗапроса;
	
КонецФункции


Функция ОтделениеЧисловойЧастиОтПрочего(СтрокаПроверки)
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ(КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура ("ЧисловаяЧ, ПрочаяЧ", Лев(СтрокаПроверки, а-1), Прав(СтрокаПроверки, СтрДлина(СтрокаПроверки)-(а-1)));
КонецФункции

Функция ПредставлениеМесяца(НомерМесяца)
	
	Месяца = Новый Соответствие;
	Месяца.Вставить(1, "Январь");
	Месяца.Вставить(2, "Февраль");
	Месяца.Вставить(3, "Март");
	Месяца.Вставить(4, "Апрель");
	Месяца.Вставить(5, "Май");
	Месяца.Вставить(6, "Июнь");
	Месяца.Вставить(7, "Июль");
	Месяца.Вставить(8, "Август");
	Месяца.Вставить(9, "Сентябрь");
	Месяца.Вставить(10, "Октябрь");
	Месяца.Вставить(11, "Ноябрь");
	Месяца.Вставить(12, "Декабрь");
	
	Возврат  Месяца.Получить(НомерМесяца);
	
КонецФункции

Функция УчастокПодходит(Участок)
	
	Если грв_СтрокаВЧисло(Участок.Код) >= 100 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция грв_СтрокаВЧисло(Знач СтрокаЧисло) Экспорт
 
 ЧислоРез = "";
 Для Индекс = 1 По СтрДлина(СтрокаЧисло) Цикл
  Символ = Сред(СтрокаЧисло, Индекс, 1);
  КодСимвола = КодСимвола(Символ);
  Если ((КодСимвола >= 48 И КодСимвола <= 57) Или (Символ = "-" И Индекс = 1) Или (Символ = ",") Или (Символ = ".") Или (Символ = " ") Или (КодСимвола = 160)) Тогда
   Если КодСимвола <> 32 И КодСимвола <> 160 Тогда
    ЧислоРез = ЧислоРез + Символ;
   КонецЕсли; 
  Иначе
   Прервать;
  КонецЕсли;
 КонецЦикла;
 
 ЧислоРез = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧислоРез);
 
 Возврат ЧислоРез;
 
КонецФункции

//shevtsov 18.02.26 Начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьЭлементы();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЭлементы()
	
	ГруппаВыгрузка = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), Элементы.ПериодУслугаТип);
	ГруппаВыгрузка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВыгрузка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВыгрузка.ОтображатьЗаголовок = ЛОЖЬ;
	ГруппаВыгрузка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("Каталог",Новый ОписаниеТипов("Строка",,));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Каталог", Тип("ПолеФормы"), ГруппаВыгрузка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.ПутьКДанным = "Каталог";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "КаталогНачалоВыбора");
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СохранитьВФайлы");
	НоваяКоманда.Заголовок = "Сохранить в файлы";
	НоваяКоманда.Действие = "СохранитьВФайлы";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СохранитьВФайлы", Тип("КнопкаФормы"), ГруппаВыгрузка);
	НовыйЭлемент.Заголовок = "Сохранить в файлы";
	НовыйЭлемент.ИмяКоманды = "СохранитьВФайлы";
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайлы(Команда)
	
	Если ЗначениеЗаполнено(Период) Тогда
		
		ПолучитьТабличныеДокументыПоАдресам();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Файлы сформированы.'");
		Сообщение.Сообщить();
		
	Иначе
		
	 	Сообщить("Для формирования отчета необходимо установить отбор на период. И либо отбор на адрес, либо на подходящий участок");
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабличныеДокументыПоАдресам()
	
	КаталогСохранения = СтрШаблон("%1\%2-%3", ЭтаФорма.Каталог, Формат(Период.ДатаНачала, "ДФ=yyyyMMdd"), Формат(Период.ДатаОкончания, "ДФ=yyyyMMdd"));
	УчастокВПамяти = Участок;
	АдресВПамяти = Адрес;
	Участок = Справочники.бит_ТехническиеУчастки.ПустаяСсылка();
	Адрес = Справочники.бит_СписокЗданий.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ТехническиеУчастки.Ссылка КАК Участок,
	               |	бит_СписокЗданий.Ссылка КАК Здание,
				   |	бит_СписокЗданий.Код КАК КодЗдания
	               |ИЗ
	               |	Справочник.бит_ТехническиеУчастки КАК бит_ТехническиеУчастки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |		ПО бит_ТехническиеУчастки.Ссылка = бит_СписокЗданий.Участок
	               |ГДЕ
	               |	бит_ТехническиеУчастки.Наименование ПОДОБНО ""[0-9][0-9][0-9]""
				   |	И #УсловиеУчасток
				   |	И #УсловиеЗдание
	               |ИТОГИ ПО
	               |	Участок";
				   
	Если ЗначениеЗаполнено(УчастокВПамяти) И УчастокПодходит(УчастокВПамяти) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеУчасток", "бит_ТехническиеУчастки.Ссылка В (&Участки)");
		Запрос.УстановитьПараметр("Участки", УчастокВПамяти);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеУчасток", "ИСТИНА");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВПамяти) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗдание", "бит_СписокЗданий.Ссылка В (&Адреса)");
		Запрос.УстановитьПараметр("Адреса", АдресВПамяти);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗдание", "ИСТИНА");
		
	КонецЕсли;
	
	ВыборкаПоУчасткам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоУчасткам.Следующий() Цикл
		
		КаталогСохраненияУчасток = СтрШаблон("%1\%2", КаталогСохранения, Строка(ВыборкаПоУчасткам.Участок));
		Выборка = ВыборкаПоУчасткам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СоздатьКаталог(КаталогСохраненияУчасток);
		
		Пока Выборка.Следующий() Цикл
			
			Адрес = Выборка.Здание;
			ТабличныйДокумент = СформироватьНаСервере();
			Если Не ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
				
				Путь = СтрШаблон("%1\%2.pdf", КаталогСохраненияУчасток, ПолучитьИмя(Выборка.КодЗдания));
				ТабличныйДокумент.Записать(Путь, ТипФайлаТабличногоДокумента.PDF);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Участок = УчастокВПамяти;
	Адрес = АдресВПамяти;
	
КонецПроцедуры


&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = ЭтаФорма.Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмя(С)
	
	Рез = С;
	Рез = СтрЗаменить(Рез, "\", "");
	Рез = СтрЗаменить(Рез, "/", "");
	Рез = СтрЗаменить(Рез, ":", "");
	Рез = СтрЗаменить(Рез, "*", "");
	Рез = СтрЗаменить(Рез, "?", "");
	Рез = СтрЗаменить(Рез, """", "");
	Рез = СтрЗаменить(Рез, "<", "");
	Рез = СтрЗаменить(Рез, ">", "");
	Рез = СтрЗаменить(Рез, "|", "");
	Рез = СтрЗаменить(Рез, "+", "");
	
	Имя = СокрЛП(Рез);
	
	Возврат Имя;
	
КонецФункции

//shevtsov 18.02.26 Окончание
